#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shapeshed/asimo/runs/run-5YHZmWftf632NY8W

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["george-mbp"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["com.shapeshed.bomberg"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["bomberg"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["com.shapeshed.auster"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["cdn.shapeshed.com"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["com.shapeshed.auster"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.bomberg"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["com.shapeshed.bomberg"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["cdn.shapeshed.com"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["george-mbp"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["bomberg"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["bomberg"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["cdn.shapeshed.com"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["com.shapeshed.auster"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-us-east-1["george-mbp"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.bomberg"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-us-east-1["bomberg"].aws_s3_bucket.this[0]: Refreshing state... [id=bomberg]
module.s3-us-east-1["cdn.shapeshed.com"].aws_s3_bucket.this[0]: Refreshing state... [id=cdn.shapeshed.com]
module.s3-us-east-1["com.shapeshed.auster"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-us-east-1["bomberg"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-us-east-1["cdn.shapeshed.com"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.orwell]
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.auster]
module.s3-us-east-1["george-mbp"].aws_s3_bucket.this[0]: Refreshing state... [id=george-mbp]
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.clearmatics]
module.s3-us-east-1["george-mbp"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["bomberg"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=bomberg]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.orwell]
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.clearmatics]
module.s3-us-east-1["cdn.shapeshed.com"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=cdn.shapeshed.com]
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.auster]
module.s3-us-east-1["george-mbp"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=george-mbp]
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.auster,private]
module.s3-us-east-1["bomberg"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=bomberg,private]
module.s3-us-east-1["cdn.shapeshed.com"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=cdn.shapeshed.com,private]
module.s3-us-east-1["george-mbp"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=george-mbp,private]
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.clearmatics,private]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.orwell,private]
module.s3-static-shapeshed-com.data.aws_canonical_user_id.this: Reading...
module.s3-eu-west-1["photos.shapeshed.com"].data.aws_canonical_user_id.this: Reading...
module.s3-eu-west-1["photos.shapeshed.com"].data.aws_caller_identity.current: Reading...
aws_route53_zone.shapeshed_com: Refreshing state... [id=Z0914809299OFXJQ90CQ9]
module.s3-eu-west-1["creative-corners"].data.aws_canonical_user_id.this: Reading...
module.s3-eu-west-1["creative-corners"].aws_s3_bucket.this[0]: Refreshing state... [id=creative-corners]
module.s3-static-shapeshed-com.data.aws_caller_identity.current: Reading...
module.s3-eu-west-1["creative-corners"].data.aws_caller_identity.current: Reading...
module.s3-eu-west-1["photos.shapeshed.com"].aws_s3_bucket.this[0]: Refreshing state... [id=photos.shapeshed.com]
module.s3-static-shapeshed-com.aws_s3_bucket.this[0]: Refreshing state... [id=static.shapeshed.com]
module.s3-eu-west-1["photos.shapeshed.com"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-static-shapeshed-com.data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-eu-west-1["creative-corners"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
aws_route53_record.moxie_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie.shapeshed.com_AAAA]
aws_route53_record.googlee87068e8125fba47_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_googlee87068e8125fba47.shapeshed.com_CNAME]
aws_route53_record.mail_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mail.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_MX: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_MX]
module.s3-eu-west-1["photos.shapeshed.com"].data.aws_canonical_user_id.this: Read complete after 1s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
aws_route53_record.__8e912589f272071e6beb0f31146b9819_www_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9__8e912589f272071e6beb0f31146b9819.www.shapeshed.com_CNAME]
module.s3-eu-west-1["creative-corners"].data.aws_canonical_user_id.this: Read complete after 1s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
aws_route53_record.shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_A]
module.s3-static-shapeshed-com.data.aws_canonical_user_id.this: Read complete after 1s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
aws_route53_record.mx02_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx02.shapeshed.com_AAAA]
aws_route53_record.d78e316caf6d1de59613b2e5a7e0d62b_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_d78e316caf6d1de59613b2e5a7e0d62b.shapeshed.com_CNAME]
aws_route53_record.smtp_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_smtp.shapeshed.com_CNAME]
aws_route53_record.shapeshed__domainkey_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed._domainkey.shapeshed.com_TXT]
aws_route53_record.finney_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_finney.shapeshed.com_A]
aws_route53_record.__acme-challenge_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9__acme-challenge.shapeshed.com_TXT]
aws_route53_record.finney_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_finney.shapeshed.com_AAAA]
aws_route53_record.moxie__domainkey_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie._domainkey.shapeshed.com_TXT]
aws_route53_record.mx02_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx02.shapeshed.com_A]
aws_route53_record.shgsbo4u9t_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shgsbo4u9t.shapeshed.com_CNAME]
aws_route53_record.moxie_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie.shapeshed.com_A]
aws_route53_record.shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_TXT]
aws_route53_record.w6yzyrt6eyqt_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_w6yzyrt6eyqt.shapeshed.com_CNAME]
aws_route53_record.imap_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_imap.shapeshed.com_CNAME]
aws_route53_record.mx01_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx01.shapeshed.com_A]
aws_route53_record.shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_AAAA]
aws_route53_record.mx01_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx01.shapeshed.com_AAAA]
aws_route53_record.__dmarc_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9__dmarc.shapeshed.com_TXT]
aws_route53_record.shapeshed_com_NS: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_NS]
aws_route53_record.shapeshed_com_SOA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_SOA]
aws_route53_record.__26eca8f67eb273a9cafb25ef1989fdf1_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9__26eca8f67eb273a9cafb25ef1989fdf1.shapeshed.com_CNAME]
aws_route53_record.yandex-verification_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_yandex-verification.shapeshed.com_TXT]
module.s3-eu-west-1["photos.shapeshed.com"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=photos.shapeshed.com,private]
module.s3-eu-west-1["creative-corners"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=creative-corners,private]
module.s3-eu-west-1["creative-corners"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=creative-corners]
module.s3-eu-west-1["photos.shapeshed.com"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=photos.shapeshed.com]
module.s3-static-shapeshed-com.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=static.shapeshed.com]
module.s3-static-shapeshed-com.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=static.shapeshed.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3-us-east-1["com.shapeshed.bomberg"].aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "com.shapeshed.bomberg"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3-us-east-1["com.shapeshed.bomberg"].aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.s3-us-east-1["com.shapeshed.bomberg"].aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "com.shapeshed.cdn"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "com.shapeshed.wozniak"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 9 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @shapeshed, Action: `pull_request`*